In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}

df = pd.DataFrame(data)

In [3]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

df2 = pd.DataFrame(data_list)

In [5]:
df2

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [6]:
data_list2 = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

my_columns = ["Name", "Age", "City", "Salary"]

df3 = pd.DataFrame(data_list2, columns=my_columns)

In [7]:
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
# SELECTION AND INDEXING OF COLUMNS

In [11]:
df3["Age"] > 28

0    False
1     True
2     True
3     True
Name: Age, dtype: bool

In [14]:
df3[["Name", "Age"]]

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [15]:
df3["City"]

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [16]:
# CREATING A NEW COLUMN

In [26]:
df3["Designation"] = ["Dr", "Er", "Er", "Dr"]

In [27]:
df3

    Name  Age      City  Salary Designation
0   John   28  New York   65000          Dr
1   Anna   34     Paris   70000          Er
2  Peter   29    Berlin   62000          Er
3  Linda   42    London   85000          Dr

In [28]:
# REMOVING COLUMNS

In [24]:
df3 = df3.drop("Designation", axis=1, inplace=True)

In [25]:
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [29]:
df3.drop("Designation", axis=1, inplace=True)

In [30]:
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [32]:
df3.tail()

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [33]:
# SELECTING ROWS

In [39]:
df3.loc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [40]:
df3.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [41]:
# SELECTING SUBSETS OF ROWS AND COLUMNS

In [42]:
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [44]:
df.loc[[0, 1]][["City", "Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [46]:
df3.loc[[2,3]][["Name", "Age"]]

    Name  Age
2  Peter   29
3  Linda   42

In [47]:
# CONDITIONAL SELECTION

In [48]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [49]:
# peoples having age > 30
df[df["Age"] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [55]:
# peoples having age > 30 and city = Paris
df[(df["Age"] > 30) & (df["City"] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000